In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 500)
df = sns.load_dataset("titanic")
df.head(3)

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third    man        True  NaN  Southampton    no  False
1         1       1  female  38.0      1      0  71.2833        C  First  woman       False    C    Cherbourg   yes  False
2         1       3  female  26.0      0      0   7.9250        S  Third  woman       False  NaN  Southampton   yes   True

In [5]:
for col in df.columns:
    if df[col].dtypes == "bool":
        df[col] = df[col].astype(int)

def cat_summary(dataframe, col_name, plot=False):
    print(pd.DataFrame({col_name: dataframe[col_name].value_counts(),
                        "Ratio": 100 * dataframe[col_name].value_counts() / len(dataframe)}))
    print("##########################################")

    if plot:
        sns.countplot(x=dataframe[col_name], data=dataframe)
        plt.show(block=True)
        
def grab_col_names(dataframe, cat_th=10,  car_th=20):
    # cat_cols, cat_but_car
    cat_cols = [col for col in df.columns if str(df[col].dtypes) in ["category", "object", "bool"]]

    num_but_cat = [col for col in df.columns if df[col].nunique() < 10 and df[col].dtypes in ["int", "float"]]

    cat_but_car = [col for col in df.columns if
                   df[col].nunique() > 20 and str(df[col].dtypes) in ["category", "object"]]

    cat_cols = cat_cols + num_but_cat
    cat_cols = [col for col in cat_cols if col not in cat_but_car]

    num_cols = [col for col in df.columns if df[col].dtypes in ["int64", "float64"]]
    num_cols = [col for col in num_cols if col not in cat_cols]

    print(f"Observations: {dataframe.shape[0]}")
    print(f"Variables: {dataframe.shape[1]}")
    print(f'cat_cols: {len(cat_cols)}')
    print(f'num_cols: {len(num_cols)}')
    print(f'cat_but_car: {len(cat_but_car)}')
    print(f'num_but_cat: {len(num_but_cat)}')

    return cat_cols, num_cols, cat_but_car

cat_cols, num_cols, cat_but_car = grab_col_names(df)

df.head()

Observations: 891
Variables: 15
cat_cols: 9
num_cols: 6
cat_but_car: 0
num_but_cat: 2

   survived  pclass     sex   age  sibsp  parch     fare embarked  class    who  adult_male deck  embark_town alive  alone
0         0       3    male  22.0      1      0   7.2500        S  Third    man           1  NaN  Southampton    no      0
1         1       1  female  38.0      1      0  71.2833        C  First  woman           0    C    Cherbourg   yes      0
2         1       3  female  26.0      0      0   7.9250        S  Third  woman           0  NaN  Southampton   yes      1
3         1       1  female  35.0      1      0  53.1000        S  First  woman           0    C  Southampton   yes      0
4         0       3    male  35.0      0      0   8.0500        S  Third    man           1  NaN  Southampton    no      1

In [10]:
#HEDEF DEĞİŞKEN ANALİZİ
#cinsiyet bilgisine göre hayatta kalıp kalamama durumu. tüm sınıflar için bu analizi fonksiyonlaştırarak yazalım
df.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [12]:
# Hedef Değişkenin Kategorik Değişkenler ile Analizi
def target_summary_with_cat(dataframe, target, categorical_col):
    print(pd.DataFrame({"TARGET_MEAN": dataframe.groupby(categorical_col)[target].mean()}), end="\n\n\n")


for col in cat_cols:
    target_summary_with_cat(df, "survived", col) #tüm sınıflarda kendi içerisinde hedef değişkene göre kıyaslama yap

        TARGET_MEAN
sex
female     0.742038
male       0.188908


          TARGET_MEAN
embarked
C            0.553571
Q            0.389610
S            0.336957


        TARGET_MEAN
class
First      0.629630
Second     0.472826
Third      0.242363


       TARGET_MEAN
who
child     0.590361
man       0.163873
woman     0.756458


      TARGET_MEAN
deck
A        0.466667
B        0.744681
C        0.593220
D        0.757576
E        0.750000
F        0.615385
G        0.500000


             TARGET_MEAN
embark_town
Cherbourg       0.553571
Queenstown      0.389610
Southampton     0.336957


       TARGET_MEAN
alive
no             0.0
yes            1.0


            TARGET_MEAN
adult_male
0              0.717514
1              0.163873


       TARGET_MEAN
alone
0         0.505650
1         0.303538

In [13]:
# Hedef Değişkenin Sayısal Değişkenler ile Analizi
df.groupby("survived").agg({"age":"mean"}) #haytta kalanların ve ölenlerin yaş ortalaması

                age
survived
0         30.626179
1         28.343690

In [15]:
def target_summary_with_num(dataframe, target, numerical_col):
    print(dataframe.groupby(target).agg({numerical_col: "mean"}), end="\n\n\n")
    
for col in num_cols:
    target_summary_with_num(df, "survived", col)

          survived
survived
0              0.0
1              1.0


            pclass
survived
0         2.531876
1         1.950292


                age
survived
0         30.626179
1         28.343690


             sibsp
survived
0         0.553734
1         0.473684


             parch
survived
0         0.329690
1         0.464912


               fare
survived
0         22.117887
1         48.395408